000100000000
000200000000             PGM
000300000000
000400000000             DCL        VAR(&CMPNUM) TYPE(*DEC) LEN(02 0) VALUE(1)
000401000000             DCL        VAR(&CUSNUM) TYPE(*DEC) LEN(10 0) VALUE(100)
000402000000             DCL        VAR(&YTDSAL) TYPE(*DEC) LEN(11 2)
000500000000
000501000000             CALL       PGM(APLUS2MSC/CUSYTDSALE) PARM(&CMPNUM +
000502000000                          &CUSNUM &YTDSAL)
000503000000
000600000000             DMPCLPGM
000700000000
000800000000             ENDPGM
001800000000
