000100000000     A*
000200000000     A                                      DSPSIZ(24 80 *DS3)
000300000000     A*
000400000000     A          R AR800M01W1
000500000000     A                                      CA12(12 'Cancel')
000600000000     A                                      OVERLAY
000700000000     A                                      WINDOW(10 5 6 68 *NOMSGLIN)
000800000000     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
000900000000     A                                       (*CHAR '        '))
001000000000     A                                      USRRSTDSP
001100000000     A                                  1 25'GEMKO Custom Fields'
001200000000     A                                      DSPATR(RI)
001300000000     A                                      COLOR(BLU)
001400000000     A                                  3  1'E-Mail Address:'
001500000000     A            W1EMAD        50A  B  3 19
001600000000     A                                  4  1'Website Address:'
001700000000     A            W1WSAD        50A  B  4 19
001800000000     A                                  6  1'ENTER=Accept'
001900000000     A                                      COLOR(BLU)
002000000000     A                                  6 59'F12=Bypass'
002100000000     A                                      COLOR(BLU)
002200000000     A*
002300000000     A          R AR800M01D1
002400000000     A                                      ASSUME
002500000000     A                                 24 79' '
002600000000     A*
