000100000000     A*
000200071002     A                                      DSPSIZ(24 80 *DS3)
000300000000     A*
000400071002     A          R OE101M01W1
000500071002     A                                      CA12(12 'Cancel')
000600071002     A                                      OVERLAY
000700071002     A                                      WINDOW(8 25 7 28 *NOMSGLIN)
000800071002     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
000900071002     A                                       (*CHAR '        '))
001000071002     A                                      USRRSTDSP
001100071002     A                                  1  5'GEMKO Custom Fields'
001200071002     A                                      DSPATR(RI)
001300071002     A                                      COLOR(BLU)
001400071002     A                                  3  1'Widget Category:'
001500071002     A            W1WCAT         5A  B  3 24COLOR(YLW)
001600071002     A                                  4  1'Local Dealer:'
001700071002     A            W1LCDL        10A  B  4 19COLOR(YLW)
001800071002     A                                  5  1'Followup Date:'
001900071002     A            W1FUDT         6Y 0B  5 21COLOR(YLW)
002000071002     A                                      CHECK(FE)
002100071002     A                                      EDTWRD('  /  / 0')
002200071002     A                                  7  1'ENTER=Accept'
002300071002     A                                      COLOR(BLU)
002400071002     A                                  7 19'F12=Bypass'
002500071002     A                                      COLOR(BLU)
002600000000     A*
002700071002     A          R OE101M01D1
002800000000     A                                      ASSUME
002900000000     A                                 24 79' '
003000071002     A*
