000100000000
000200000000     d                 ds                                                       orhed user area
000300000000     d  ohus30                 1     30                                         orhed user area
000400000000     d  ohwcat                 1      5                                         widget category
000500000000     d  ohlcdl                 6     15                                         local dealer
000600000000     d  ohfudt                16     25d                                        followup date
000700000000
